Coldcard/firmware/stm32/bootloader/ae.c
	rv = ae_send(OP_Random, 0, 0);
	RET_IF_BAD(rv);

	ae_delay(OP_Random);

	rv = ae_read_n(32, randout);
	RET_IF_BAD(rv);

	return 0;
}

// ae_get_info()
//
// Do Info(p1=2) command, and return result.
//
	uint16_t
ae_get_info(void)
{
	// not doing error checking here
	ae_send(OP_Info, 0x2, 0);

	ae_delay(OP_Info);

	// note: always returns 4 bytes, but most are garbage and unused.
	uint8_t tmp[4];
	ae_read_n(4, tmp);

	return (tmp[0] << 8) | tmp[1];
}

// ae_delay_time()
//
// Returns time in MS for max exec time of each command.
//
	int
ae_delay_time(aeopcode_t opcode)
{
	// worse case delay times.
	switch(opcode) {
		case OP_CheckMac:		// 0x28
			return 13;
		case OP_Counter:		// 0x24
			return 20;
		case OP_DeriveKey:		// 0x1C
			return 50;
		case OP_ECDH:			// 0x43
			return 58;
		case OP_GenDig:			// 0x15
			return 11;
		case OP_GenKey:			// 0x40
			return 115;
		case OP_HMAC:			// 0x11
			return 23;
		case OP_Info:			// 0x30
			return 2;					// officially 1, but marginal
		case OP_Lock:			// 0x17
			return 32;
		case OP_MAC:			// 0x08
			return 14;
		case OP_Nonce:			// 0x16
			return 30;					// officially 7, but need 30 for real
		case OP_Pause:			// 0x01
			return 3;
		case OP_PrivWrite:		// 0x46
			return 48;
		case OP_Random:			// 0x1B
			return 23;
		case OP_Read:			// 0x02
			return 1;
		case OP_Sign:			// 0x41
			return 50;
		case OP_SHA:			// 0x47
			return 9;
		case OP_UpdateExtra:	// 0x20
			return 10;
		case OP_Verify:			// 0x45
			return 58;
		case OP_Write:			// 0x12
			return 26;
	}

	return 100;
}

// ae_load_nonce()
//
// Load Tempkey with a specific value. Resulting Tempkey cannot be
// used with many commands/keys, but is needed for signing.
//
	int
ae_load_nonce(const uint8_t nonce[32])
{
    // p1=3
	int rv = ae_send_n(OP_Nonce, 3, 0, nonce, 32);
    RET_IF_BAD(rv);

	ae_delay(OP_Nonce);

    return ae_read1();
}

// ae_pick_nonce()
//
// Load Tempkey with a nonce value that we both know, but
// is random and we both know is random! Tricky!
//
	int
ae_pick_nonce(const uint8_t num_in[20], uint8_t tempkey[32])
{
	// we provide some 20 bytes of randomness to chip
	int	rv;

	ae_keep_alive();

	// The chip must provide 32-bytes of random-ness,
	// so no choice in args to OP.Nonce here (due to ReqRandom).
	rv = ae_send_n(OP_Nonce, 0, 0, num_in, 20);
	RET_IF_BAD(rv);

	ae_delay(OP_Nonce);

	// Nonce command returns the RNG result, but not contents of TempKey
	uint8_t randout[32];
	rv = ae_read_n(32, randout);
	RET_IF_BAD(rv);

	// Hash stuff appropriately to get same number as chip did.
	//  TempKey on the chip will be set to the output of SHA256 over 
	//  a message composed of my challenge, the RNG and 3 bytes of constants:
	//
	//		return sha256(rndout + num_in + b'\x16\0\0').digest()
	//
	SHA256_CTX ctx;

    sha256_init(&ctx);
    sha256_update(&ctx, randout, 32);
    sha256_update(&ctx, num_in, 20);
	const uint8_t fixed[3] = { 0x16, 0, 0 };
    sha256_update(&ctx, fixed, 3);

    sha256_final(&ctx, tempkey);

	return 0;
}

// ae_is_correct_tempkey()
//
// Check that TempKey is holding what we think it does. Uses the MAC
// command over contents of Tempkey and our shared secret. Die if wrong.
//
    bool
ae_is_correct_tempkey(const uint8_t expected_tempkey[32])
{
    const uint8_t mode =   (1<<6)     // include full serial number
                         | (0<<2)     // TempKey.SourceFlag == 0 == 'rand'
                         | (0<<1)     // first 32 bytes are the shared secret
                         | (1<<0);    // second 32 bytes are tempkey

	int rv = ae_send(OP_MAC, mode, KEYNUM_pairing);
    if(rv) return false;

	ae_delay(OP_MAC);

    // read chip's answer
	uint8_t resp[32];
	rv = ae_read_n(32, resp);
    if(rv) return false;

    ae_keep_alive();

    // Duplicate the hash process, and then compare.
	SHA256_CTX ctx;

    sha256_init(&ctx);
    sha256_update(&ctx, rom_secrets->pairing_secret, 32);
    sha256_update(&ctx, expected_tempkey, 32);

	const uint8_t fixed[16] = { OP_MAC, mode, KEYNUM_pairing, 0x0,
                                    0,0,0,0, 0,0,0,0,       // eight zeros
                                    0,0,0,                  // three zeros
                                    0xEE };
    sha256_update(&ctx, fixed, sizeof(fixed));

    sha256_update(&ctx, ((const uint8_t *)rom_secrets->ae_serial_number)+4, 4);
    sha256_update(&ctx, ((const uint8_t *)rom_secrets->ae_serial_number)+0, 4);

#if 0
	// this verifies no problem.
	ASSERT(ctx.datalen + (ctx.bitlen/8) == 32+32+1+1+2+8+3+1+4+2+2);        // == 88
#endif

    uint8_t         actual[32];
    sha256_final(&ctx, actual);

    return check_equal(actual, resp, 32);
}

// ae_checkmac_hard()
//
// Check the chip produces a hash over various things the same way we would
// meaning that we both know the shared secret and the state of stuff in
// the 508a is what we expect.
//
    int
ae_checkmac_hard(uint8_t keynum, const uint8_t secret[32])
{
    uint8_t     digest[32];

    int rv = ae_gendig_slot(keynum, secret, digest);
    RET_IF_BAD(rv);

    // NOTE: we use this sometime when we know the value is wrong, like
    // checking for blank pin codes... so not a huge error/security issue
    // if wrong here.
    if(!ae_is_correct_tempkey(digest)) return -2;

    // worked.
    return 0;
}

// ae_pair_unlock()
//
// Do a dance that unlocks access to the private key for signing.
// Purpose is to show we are a pair of chips that belong together.
//
	int
ae_pair_unlock()
{
    return ae_checkmac(KEYNUM_pairing, rom_secrets->pairing_secret);
}

// ae_checkmac()
//
// CAUTION: The result from this function could be modified by an
// active attacker on the bus because the one-byte response from the chip
// is easily replaced. This command is useful for us to authorize actions
// inside the 508a, like use of a specific key, not for us to authenticate
// the 508a or its contents/state.
//
    int
ae_checkmac(uint8_t keynum, const uint8_t secret[32])
{
	int rv;

	// Since this is part of the hash, we want random bytes
	// for our "other data". Also a number for "numin" of nonce
	uint8_t od[32], numin[20];

	rng_buffer(od, sizeof(od));
	rng_buffer(numin, sizeof(numin));

