Coldcard/firmware/stm32/bootloader/ae.c
    // need this one, want to reset watchdog to this point.
	ae_keep_alive();

	// - load tempkey with a known nonce value
	uint8_t zeros[8] = {0};
	uint8_t tempkey[32];
	rv = ae_pick_nonce(numin, tempkey);
	RET_IF_BAD(rv);

	// - hash nonce and lots of other bits together
	SHA256_CTX ctx;
    sha256_init(&ctx);

    // shared secret is 32 bytes from flash
    sha256_update(&ctx, secret, 32);

    sha256_update(&ctx, tempkey, 32);
    sha256_update(&ctx, &od[0], 4);

    sha256_update(&ctx, zeros, 8);

    sha256_update(&ctx, &od[4], 3);

	uint8_t ee = 0xEE;
    sha256_update(&ctx, &ee, 1);
    sha256_update(&ctx, &od[7], 4);

	uint8_t snp[2] = { 0x01, 0x23 };
    sha256_update(&ctx, snp, 2);
    sha256_update(&ctx, &od[11], 2);

	// format the request body
	struct {
		uint8_t		ch3[32];		// not actually used, but has to be there
		uint8_t		resp[32];
		uint8_t		od[13];
	} req;

    // content doesn't matter, but nice and visible:
    memcpy(req.ch3, copyright_msg, 32);

#if 0
	// this verifies no problem.
	int l = (ctx.blocks * 64) + ctx.npartial;
	ASSERT(l == 32+32+4+8+3+1+4+2+2);			// == 88
#endif

    sha256_final(&ctx, req.resp);
	memcpy(req.od, od, 13);

	STATIC_ASSERT(sizeof(req) == 32 + 32 + 13);

	// Give our answer to the chip.
	rv = ae_send_n(OP_CheckMac, 0x01, keynum, (uint8_t *)&req, sizeof(req));

	ae_delay(OP_CheckMac);

	rv = ae_read1();
	if(rv != 0) {
		// did it work?! No.
		if(rv == AE_CHECKMAC_FAIL) {
			ERR("CM fail");				// typical case: our hashs don't match
		} else {
			ERRV(rv, "CheckMac");
		}
		return -1;
	}

#if 0
	// double check?
	uint16_t ii = ae_get_info();
	// expect 0x005d for key 11

	if(!I_AuthValid(ii) || (I_AuthKey(ii) != keynum)) {
		ERR("Info r/b");
		return -1;
	}
#endif

	// just in case ... always restart watchdog timer.
	ae_keep_alive();

	return 0;
}

// ae_sign()
//
// Sign a message (already digested)
//
	int
ae_sign(uint8_t keynum, uint8_t msg_hash[32], uint8_t signature[64])
{
	int rv = ae_load_nonce(msg_hash);
	RET_IF_BAD(rv);

	rv = ae_send_n(OP_Sign, 0x80, keynum, NULL, 0);
	RET_IF_BAD(rv);

	ae_delay(OP_Sign);

	rv = ae_read_n(64, signature);
	RET_IF_BAD(rv);

	return 0;
}

// ae_get_counter()
//
// Inc and return the one-way counter.
//
	int
ae_get_counter(uint32_t *result, int counter_number, bool incr)
{
	int rv = ae_send(OP_Counter, incr ? 0x1 : 0x0, counter_number);
	RET_IF_BAD(rv);

	ae_delay(OP_Counter);

	// already in correct endian
	rv = ae_read_n(4, (uint8_t *)result);
	RET_IF_BAD(rv);

    // IMPORTANT: Always verify the counter's value because otherwise
    // nothing prevents an active MitM changing the value that we think
    // we just read.

    uint8_t     digest[32];
    rv = ae_gendig_counter(counter_number, *result, digest);
	RET_IF_BAD(rv);

    if(!ae_is_correct_tempkey(digest)) {
        // no legit way for this to happen, so just die.
        fatal_mitm();
    }

    // worked.
    return 0;
}

#if 0
// ae_make_mac()
//
// Generate a MAC for the indicated key. Will be dependent on serial number.
//
	int
ae_make_mac(uint8_t keynum, uint8_t challenge[32], uint8_t mac_out[32])
{
	int rv = ae_send_n(OP_MAC, (1<<6), keynum, challenge, 32);

	ae_delay(OP_MAC);

	rv = ae_read_n(32, mac_out);
	RET_IF_BAD(rv);

	return 0;
}
#endif

#if 0
// ae_hmac()
//
// Perform HMAC on the chip, using a particular key.
//
	int
ae_hmac(uint8_t keynum, const uint8_t *msg, uint16_t msg_len, uint8_t digest[32])
{
	// setup SHA in HMAC mode.
	int rv = ae_send(OP_SHA, 0x04, keynum);
	RET_IF_BAD(rv);

	ae_delay(OP_SHA);

	rv = ae_read1();
	if(rv != AE_COMMAND_OK) return -1;

	// send full blocks, if any.

	while(msg_len >= 64) {
		rv = ae_send_n(OP_SHA, 0x01, 64, msg, 64);
		RET_IF_BAD(rv);
		ae_delay(OP_SHA);

		rv = ae_read1();
		if(rv != AE_COMMAND_OK) return -1;

		msg += 64;
		msg_len -= 64;
	}

	// finalize, with final 0 to 63 bytes
	rv = ae_send_n(OP_SHA, 0x02, msg_len, msg, msg_len);
	RET_IF_BAD(rv);

	ae_delay(OP_SHA);

	rv = ae_read_n(32, digest);
	RET_IF_BAD(rv);

	return 0;
}
#endif

// ae_hmac32()
//
// Different opcode, OP_HMAC does exactly 32 bytes w/ less steps.
//
    int
ae_hmac32(uint8_t keynum, const uint8_t msg[32], uint8_t digest[32])
{
    // Load tempkey w/ message to be HMAC'ed
	int rv = ae_load_nonce(msg);
	RET_IF_BAD(rv);

	// Ask for HMAC using specific key
	rv = ae_send(OP_HMAC, (1<<2) | (1<<6), keynum);
	RET_IF_BAD(rv);

	ae_delay(OP_HMAC);

	rv = ae_read_n(32, digest);
	RET_IF_BAD(rv);

	return 0;
}

// ae_get_serial()
//
// Return the serial number: it's 9 bytes, altho 3 are fixed.
//
	int
ae_get_serial(uint8_t serial[6])
{
	int rv = ae_send(OP_Read, 0x80, 0x0);
	RET_IF_BAD(rv);

	ae_delay(OP_Read);

	uint8_t temp[32];
	rv = ae_read_n(32, temp);
	RET_IF_BAD(rv);

    // reformat to 9 bytes.
    uint8_t ts[9];
	memcpy(ts, &temp[0], 4);
	memcpy(&ts[4], &temp[8], 5);

    // check the hard-coded values
    if((ts[0] != 0x01) || (ts[1] != 0x23) || (ts[8] != 0xEE)) return 1;

    // save only the unique bits.
    memcpy(serial, ts+2, 6);

	return 0;
}


// ae_slot_locks()
//
// Read a 16-bit bitmask of which data slots are presently locked.
//
    int
ae_slot_locks(void)
{
    // Bytes 88, 89 in the Config zone is a bitmap of
    // which slots are locked. Have to read 4 bytes here tho
	int rv = ae_send(OP_Read, 0x00, 88/4);
    if(rv) return -1;

	ae_delay(OP_Read);

	uint8_t tmp[4];
	rv = ae_read_n(4, tmp);
    if(rv) return -2;

    // returns positive 16-bit number on success
	return (tmp[1] << 8) | tmp[0];
}

// ae_write_data_slot()
//
// -- can also lock it.
//
    int
ae_write_data_slot(int slot_num, const uint8_t *data, int len, bool lock_it)
{
    ASSERT(len == 32 || len == 72);      // limitation for this project.

    for(int blk=0; blk<3; blk++) {
        // have to write each "block" of 32-bytes, separately
        // zone => data
        int rv = ae_send_n(OP_Write, 0x80|2, (blk<<8) | (slot_num<<3), data+(blk*32), 32);
        RET_IF_BAD(rv);

        ae_delay(OP_Write);

        rv = ae_read1();
        RET_IF_BAD(rv);

        if(len == 32) break;
    }

    if(lock_it) {
        ASSERT(slot_num != 8);          // no support for mega slot 8
        ASSERT(len == 32);

        // Assume 36/72-byte long slot, which will be partially written, and rest
        // should be ones.
        const int slot_len = (slot_num <= 7) ? 36 : 72;
        uint8_t copy[slot_len];
        memset(copy, 0xff, slot_len);

        memcpy(copy, data, len);

        // calc expected CRC
        uint8_t crc[2] = {0, 0};
        crc16_chain(slot_len, copy, crc);

        // do the lock
        int rv = ae_send(OP_Lock, 2 | (slot_num << 2), (crc[1]<<8) | crc[0]);
        RET_IF_BAD(rv);

        ae_delay(OP_Lock);

        rv = ae_read1();
        RET_IF_BAD(rv);
    }

