Coldcard/firmware/stm32/bootloader/ae.c
    return 0;
}

// ae_gendig_slot()
//
    int
ae_gendig_slot(int slot_num, const uint8_t slot_contents[32], uint8_t digest[32])
{
    // Construct a digest on the device (and here) that depends on the secret
    // contents of a specific slot.
    uint8_t num_in[20], tempkey[32];

	rng_buffer(num_in, sizeof(num_in));
	int rv = ae_pick_nonce(num_in, tempkey);
    RET_IF_BAD(rv);

    //using Zone=2="Data" => "KeyID specifies a slot in the Data zone"
    rv = ae_send(OP_GenDig, 0x2, slot_num);
    RET_IF_BAD(rv);

    ae_delay(OP_GenDig);

    rv = ae_read1();
    RET_IF_BAD(rv);

    ae_keep_alive();

    // we now have to match the digesting (hashing) that has happened on
    // the chip. No feedback at this point if it's right tho.
    //
    //   msg = hkey + b'\x15\x02' + ustruct.pack("<H", slot_num)
    //   msg += b'\xee\x01\x23' + (b'\0'*25) + challenge
    //   assert len(msg) == 32+1+1+2+1+2+25+32
    //
	SHA256_CTX ctx;
    sha256_init(&ctx);

	uint8_t args[7] = { OP_GenDig, 2, slot_num, 0, 0xEE, 0x01, 0x23 };
    uint8_t zeros[25] = { 0 };

    sha256_update(&ctx, slot_contents, 32);
    sha256_update(&ctx, args, sizeof(args));
    sha256_update(&ctx, zeros, sizeof(zeros));
    sha256_update(&ctx, tempkey, 32);

    sha256_final(&ctx, digest);

    return 0;
}

// ae_gendig_counter()
//
// Construct a digest over one of the two counters. Track what we think
// the digest should be, and ask the chip to do the same. Verify we match
// using MAC command (done elsewhere).
//
    int
ae_gendig_counter(int counter_num, const uint32_t expected_value, uint8_t digest[32])
{
    uint8_t num_in[20], tempkey[32];

	rng_buffer(num_in, sizeof(num_in));
	int rv = ae_pick_nonce(num_in, tempkey);
    RET_IF_BAD(rv);

    //using Zone=4="Counter" => "KeyID specifies the monotonic counter ID"
    rv = ae_send(OP_GenDig, 0x4, counter_num);
    RET_IF_BAD(rv);

    ae_delay(OP_GenDig);

    rv = ae_read1();
    RET_IF_BAD(rv);

    ae_keep_alive();

    // we now have to match the digesting (hashing) that has happened on
    // the chip. No feedback at this point if it's right tho.
    //
    //   msg = hkey + b'\x15\x02' + ustruct.pack("<H", slot_num)
    //   msg += b'\xee\x01\x23' + (b'\0'*25) + challenge
    //   assert len(msg) == 32+1+1+2+1+2+25+32
    //
	SHA256_CTX ctx;
    sha256_init(&ctx);

    uint8_t zeros[32] = { 0 };
	uint8_t args[8] = { OP_GenDig, 0x4, counter_num, 0,  0xEE, 0x01, 0x23, 0x0 };

    sha256_update(&ctx, zeros, 32);
    sha256_update(&ctx, args, sizeof(args));
    sha256_update(&ctx, (const uint8_t *)&expected_value, 4);
    sha256_update(&ctx, zeros, 20);
    sha256_update(&ctx, tempkey, 32);

    sha256_final(&ctx, digest);

    return 0;
}

// ae_encrypted_read32()
//
    static int
ae_encrypted_read32(int data_slot, int blk,
                    int read_kn, const uint8_t read_key[32], uint8_t data[32])
{
    uint8_t     digest[32];

    ae_keep_alive();
    ae_pair_unlock();

    int rv = ae_gendig_slot(read_kn, read_key, digest);
    RET_IF_BAD(rv);

    // read nth 32-byte "block"
    rv = ae_send(OP_Read, 0x82, (blk << 8) | (data_slot<<3));
    RET_IF_BAD(rv);

    ae_delay(OP_Read);

    rv = ae_read_n(32, data);
    RET_IF_BAD(rv);

    xor_mixin(data, digest, 32);

    return 0;
}

// ae_encrypted_read()
//
    int
ae_encrypted_read(int data_slot, int read_kn, const uint8_t read_key[32], uint8_t *data, int len)
{
    // not clear if chip supports 4-byte encrypted reads 
    ASSERT((len == 32) || (len == 72));

    int rv = ae_encrypted_read32(data_slot, 0, read_kn, read_key, data);
    RET_IF_BAD(rv);

    if(len == 32) return 0;

    rv = ae_encrypted_read32(data_slot, 1, read_kn, read_key, data+32);
    RET_IF_BAD(rv);

    uint8_t tmp[32];
    rv = ae_encrypted_read32(data_slot, 2, read_kn, read_key, tmp);
    RET_IF_BAD(rv);

    memcpy(data+64, tmp, 72-64);

    return 0;
}

// ae_encrypted_write()
//
    static int
ae_encrypted_write32(int data_slot, int blk, int write_kn,
                        const uint8_t write_key[32], const uint8_t data[32])
{
    uint8_t digest[32];

    ae_keep_alive();
    ae_pair_unlock();

    // generate a hash over shared secret and rng
    int rv = ae_gendig_slot(write_kn, write_key, digest);
    RET_IF_BAD(rv);

    // encrypt the data to be written, and append an authenticating MAC
    uint8_t body[32 + 32];

    for(int i=0; i<32; i++) {
        body[i] = data[i] ^ digest[i];
    }

    // make auth-mac to go with
	//	SHA-256(TempKey, Opcode, Param1, Param2, SN<8>, SN<0:1>, <25 bytes of zeros>, PlainTextData)
	//	msg = (dig 
	//	    + ustruct.pack('<bbH', OP.Write, args['p1'], args['p2']) 
	//	    + b'\xee\x01\x23'
	//	    + (b'\0'*25)
	//	    + new_value)
	//	assert len(msg) == 32+1+1+2+1+2+25+32
	//		
	SHA256_CTX ctx;
    sha256_init(&ctx);

    uint8_t p1 = 0x80|2;        // 32 bytes into a data slot
    uint8_t p2_lsb = (data_slot << 3); 
    uint8_t p2_msb = blk;

	uint8_t args[7] = { OP_Write, p1, p2_lsb, p2_msb, 0xEE, 0x01, 0x23 };
    uint8_t zeros[25] = { 0 };

    sha256_update(&ctx, digest, 32);
    sha256_update(&ctx, args, sizeof(args));
    sha256_update(&ctx, zeros, sizeof(zeros));
    sha256_update(&ctx, data, 32);

    sha256_final(&ctx, &body[32]);

    rv = ae_send_n(OP_Write, p1, (p2_msb << 8) | p2_lsb, body, sizeof(body));
    RET_IF_BAD(rv);

    ae_delay(OP_Write);

    rv = ae_read1();
    RET_IF_BAD(rv);

    return 0;
}

// ae_encrypted_write()
//
    int
ae_encrypted_write(int data_slot, int write_kn, const uint8_t write_key[32],
                        const uint8_t *data, int len)
{
    for(int blk=0; blk<3 && len>0; blk++, len-=32) {
        int here = MIN(32, len);

        // be nice and don't read past end of input buffer
        uint8_t     tmp[32] = { 0 };
        memcpy(tmp, data+(32*blk), here);

        int rv = ae_encrypted_write32(data_slot, blk, write_kn, write_key, tmp);
        RET_IF_BAD(rv);
    }

    return 0;
}

// ae_read_data_slot()
//
    int
ae_read_data_slot(int slot_num, uint8_t *data, int len)
{
    ASSERT((len == 4) || (len == 32) || (len == 72));

    // zone => data
    // only reading first block of 32 bytes. ignore the rest
    int rv = ae_send(OP_Read, (len == 4 ? 0x00 : 0x80) | 2, (slot_num<<3));
    RET_IF_BAD(rv);

    ae_delay(OP_Read);

    rv = ae_read_n((len == 4) ? 4 : 32, data);
    RET_IF_BAD(rv);

    if(len == 72) {
        // read second block
        int rv = ae_send(OP_Read, 0x82, (1<<8) | (slot_num<<3));
        RET_IF_BAD(rv);

        ae_delay(OP_Read);

        rv = ae_read_n(32, data+32);
        RET_IF_BAD(rv);

        // read third block, but only using part of it
        uint8_t     tmp[32];
        rv = ae_send(OP_Read, 0x82, (2<<8) | (slot_num<<3));
        RET_IF_BAD(rv);

        ae_delay(OP_Read);

        rv = ae_read_n(32, tmp);
        RET_IF_BAD(rv);

