Coldcard/firmware/stm32/bootloader/ae.c
        memcpy(data+64, tmp, 72-64);
    }

    return 0;
}

// ae_config_write()
//
    static int
ae_config_write(const uint8_t config[128])
{
    // send all 128 bytes, less some that can't be written.
    for(int n=16; n<128; n+= 4) {
        if((n >= 84) && (n < 90)) {
            continue;
        }

        // Must work on words, since can't write to most of the complete blocks.
        //  args = write_params(block=n//32, offset=n//4, is_config=True)
        //  p2 = (block << 3) | offset
        int rv = ae_send_n(OP_Write, 0, n/4, &config[n], 4);
        RET_IF_BAD(rv);

        ae_delay(OP_Write);
    
		rv = ae_read1();
        if(rv) return rv;
    }

    return 0;
}

// ae_lock_config_zone()
//
    static int
ae_lock_config_zone(const uint8_t config[128])
{
    // calc expected CRC
    uint8_t crc[2] = {0, 0};

    crc16_chain(128, config, crc);

    // do the lock: mode=0
    int rv = ae_send(OP_Lock, 0x0, (crc[1]<<8) | crc[0]);
    RET_IF_BAD(rv);

    ae_delay(OP_Lock);

    return ae_read1();
}

// ae_lock_data_zone()
//
    static int
ae_lock_data_zone(void)
{
    // NOTE: I haven't been able to calc CRC right, so not using it.

    // do the lock: mode=1 (datazone) + 0x80 (no CRC check)
    int rv = ae_send(OP_Lock, 0x81, 0x0000);
    RET_IF_BAD(rv);

    ae_delay(OP_Lock);

    return ae_read1();
}


// ae_sha256()
//
	int
ae_sha256(const uint8_t *msg, int msg_len, uint8_t digest[32])
{
	// setup
	int rv = ae_send(OP_SHA, 0x00, 0);
	RET_IF_BAD(rv);

	ae_delay(OP_SHA);

	rv = ae_read1();
	if(rv != AE_COMMAND_OK) return -1;

	while(msg_len >= 64) {
		rv = ae_send_n(OP_SHA, 0x01, 64, msg, 64);
		RET_IF_BAD(rv);
		ae_delay(OP_SHA);

		rv = ae_read1();
		if(rv != AE_COMMAND_OK) return -1;

		msg += 64;
		msg_len -= 64;
	}

	// finalize, with final 0 to 63 bytes
	rv = ae_send_n(OP_SHA, 0x02, msg_len, msg, msg_len);
	RET_IF_BAD(rv);

	ae_delay(OP_SHA);

	rv = ae_read_n(32, digest);
	RET_IF_BAD(rv);

	return 0;
}

// ae_set_gpio()
//
    int
ae_set_gpio(int state)
{
    // 1=turn on green, 0=red light (if not yet configured to be secure)
    int rv = ae_send(OP_Info, 3, 2 | (!!state));
	RET_IF_BAD(rv);

	ae_delay(OP_Info);

    // "Always return the current state in the first byte followed by three bytes of 0x00"
    // - simple 1/0, in LSB.
    uint8_t resp[4];

    rv = ae_read_n(4, resp);
	RET_IF_BAD(rv);

    return (resp[0] != state) ? -1 : 0;
}

// ae_set_gpio_secure()
//
// Set the GPIO using secure hash generated somehow already.
//
    int
ae_set_gpio_secure(uint8_t digest[32])
{
    ae_pair_unlock();
    ae_checkmac(KEYNUM_firmware, digest);

    return ae_set_gpio(1);
}

// ae_get_gpio()
//
// Do Info(p1=3) command, and return result.
//
	uint8_t
ae_get_gpio(void)
{
	// not doing error checking here
	ae_send(OP_Info, 0x3, 0);

	ae_delay(OP_Info);

	// note: always returns 4 bytes, but most are garbage and unused.
	uint8_t tmp[4];
	ae_read_n(4, tmp);

	return tmp[0];
}

// ae_read_config()
//
// Read a byte from config area.
//
    int
ae_read_config_byte(int offset)
{
	uint8_t tmp[4];

    ae_read_config_word(offset, tmp);

	return tmp[offset % 4];
}

// ae_read_config_word()
//
// Read a 4-byte area from config area, or -1 if fail.
//
    int
ae_read_config_word(int offset, uint8_t *dest)
{
    offset &= 0x7f;

    // read 32 bits (aligned)
	int rv = ae_send(OP_Read, 0x00, offset/4);
    if(rv) return -1;

	ae_delay(OP_Read);

	rv = ae_read_n(4, dest);
    if(rv) return -1;

    return 0;
}


// ae_destroy_key()
//
    int
ae_destroy_key(int keynum)
{
	uint8_t numin[20];

	// Load tempkey with a known (random) nonce value
	rng_buffer(numin, sizeof(numin));
	int rv = ae_send_n(OP_Nonce, 0, 0, numin, 20);
	RET_IF_BAD(rv);

	ae_delay(OP_Nonce);

	// Nonce command returns the RNG result, not contents of TempKey,
    // but since we are destroying, no need to calculate what it is.
	uint8_t randout[32];
	rv = ae_read_n(32, randout);
	RET_IF_BAD(rv);

    // do a "DeriveKey" operation, based on that!
	rv = ae_send(OP_DeriveKey, 0x00, keynum);
    if(rv) return -1;

	ae_delay(OP_DeriveKey);

    return ae_read1();
}

// ae_setup_config()
//
// One-time config and lockdown of the chip
//
// CONCERN: Must not be possible to call this function after replacing
// the chip deployed originally. But key secrets would have been lost
// by then anyway... looks harmless, and regardless once the datazone
// is locked, none of this code will work... but:
//
// IMPORTANT: If they blocked the real chip, and provided a blank one for
// us to write the (existing) pairing secret into, they would see the pairing
// secret in cleartext. They could then restore original chip and access freely.
//
    int
ae_setup_config(void)
{
    // Is data zone is locked?
    // Allow rest of function to happen if it's not.

    //  0x55 = unlocked; 0x00 = locked
    bool data_locked = (ae_read_config_byte(86) != 0x55);
    if(data_locked) return 0;       // basically success

    // Program the "config" area, and then lock it.

    // To lock, we need a CRC over whole thing, but we
    // only set a few values... plus the serial number is
    // in there, so start with some readout.
    uint8_t config[4 * 32];

    for(int blk=0; blk<4; blk++) {
        // read 32 bytes (aligned) from config "zone"
        int rv = ae_send(OP_Read, 0x80, blk<<3);
        if(rv) return EIO;

        ae_delay(OP_Read);

        rv = ae_read_n(32, &config[32*blk]);
        if(rv) return EIO;
    }

    // verify some fixed values
    ASSERT(config[0] == 0x01);
    ASSERT(config[1] == 0x23);
    ASSERT(config[12] == 0xee);

    uint8_t serial[9];
	memcpy(serial, &config[0], 4);
	memcpy(&serial[4], &config[8], 5);

    if(check_all_ones(rom_secrets->ae_serial_number, 9)) {
        // flash is empty; remember this serial number
        flash_save_ae_serial(serial);
    }

    if(!check_equal(rom_secrets->ae_serial_number, serial, 9)) {
        // write failed?
        // we're already linked to a different chip? Write failed?
        return EPERM;
    }

    // Setup steps:
    // - write config zone data
    // - lock that
    // - write pairing secret (test it works)
    // - pick RNG value for words secret (and forget it)
    // - set all PIN values to known value (zeros)
    // - set all money secrets to knonw value (zeros)
    // - lock the data zone

    if(config[87] == 0x55) {
        // config is still unlocked

        // setup "config zone" area of the chip
        static const uint8_t    config_1[] = AE_CHIP_CONFIG_1;
        static const uint8_t    config_2[] = AE_CHIP_CONFIG_2;

