Coldcard/firmware/stm32/bootloader/ae.c
        STATIC_ASSERT(sizeof(config_1) == 84-16);
        STATIC_ASSERT(sizeof(config_2) == 128-90);

        memcpy(&config[16], config_1, sizeof(config_1));
        memcpy(&config[90], config_2, sizeof(config_2));

        // write it.
        if(ae_config_write(config)) {
            INCONSISTENT("conf wr");
        }

        ae_keep_alive();

        // lock config zone
        if(ae_lock_config_zone(config)) {
            INCONSISTENT("conf lock");
        }
    } else {
        // check config is what we need? but when would that happen?
        // omit this check, since only useful for debug cases
    }

    // Load data zone with some known values.
    // The datazone still unlocked, so no encryption needed (nor possible).

    
    // will use zeros for all PIN codes, and secret starting values
    uint8_t     zeros[72];
    memset(zeros, 0, sizeof(zeros));

    for(int kn=0; kn<16; kn++) {
        ae_keep_alive();

        switch(kn) {
            default:
            case 15: break;

            case KEYNUM_pairing:
                if(ae_write_data_slot(kn, rom_secrets->pairing_secret, 32, false)) {
                    INCONSISTENT("wr pair");
                }
                break;


            case KEYNUM_words: {
                    // - hmac key for phishing words (and then we forget it)
                    uint8_t     tmp[32];
                    rng_buffer(tmp, sizeof(tmp));

                    if(ae_write_data_slot(kn, tmp, 32, true)) {
                        INCONSISTENT("wr word");
                    }
                }
                break;

            case KEYNUM_pin_1:
            case KEYNUM_pin_2:
            case KEYNUM_pin_3:
            case KEYNUM_pin_4:
            case KEYNUM_lastgood_1:
            case KEYNUM_lastgood_2:
            case KEYNUM_brickme:
            case KEYNUM_firmware:
                if(ae_write_data_slot(kn, zeros, 32, false)) {
                    INCONSISTENT("wr blk 32");
                }
                break;

            case KEYNUM_secret_1:
            case KEYNUM_secret_2:
            case KEYNUM_secret_3:
            case KEYNUM_secret_4:
                if(ae_write_data_slot(kn, zeros, 72, false)) {
                    INCONSISTENT("wr blk 72");
                }
                break;

            case 0:
                if(ae_write_data_slot(kn, (const uint8_t *)copyright_msg, 32, true)) {
                    INCONSISTENT("wr (c)");
                }
                break;
        }
    }

    // lock the data zone and effectively enter normal operation.
    ae_keep_alive();
    if(ae_lock_data_zone()) {
        INCONSISTENT("data lock");
    }

    return 0;
}
// EOF
